In [64]:
import pandas as pd

In [65]:
data = {
    "Name": ["Dilan","Kamal","Nimal"],
    "Age": [23,21,22]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age
0  Dilan   23
1  Kamal   21
2  Nimal   22
<class 'pandas.core.frame.DataFrame'>

- By default row label and row indexes are same
- access from label

In [66]:
print(df.loc[2])

Name    Nimal
Age        22
Name: 2, dtype: object

- access from index

In [67]:
print(df.iloc[2,0])

Nimal

In [68]:
df = pd.DataFrame(data,index=["day_1","day_2","day_3"])
print(df)

        Name  Age
day_1  Dilan   23
day_2  Kamal   21
day_3  Nimal   22

In [69]:
print(df.loc["day_2"])

Name    Kamal
Age        21
Name: day_2, dtype: object

In [70]:
print(df.loc[["day_1","day_3"]])

        Name  Age
day_1  Dilan   23
day_3  Nimal   22

In [71]:
df["Name"]

day_1    Dilan
day_2    Kamal
day_3    Nimal
Name: Name, dtype: object

In [72]:
data = {
    'Age': [23,30,35,40,60],
    'Salary': [50000,60000,70000,80000,90000]
}

df_salary = pd.DataFrame(data)

In [73]:
print(df_salary)

   Age  Salary
0   23   50000
1   30   60000
2   35   70000
3   40   80000
4   60   90000

In [74]:
print(df_salary.shape[0])

print(len(df_salary))

5
5

In [75]:
print(df_salary.iloc[-1])

Age          60
Salary    90000
Name: 4, dtype: int64

In [76]:
print(df_salary.columns)
print(list(df_salary.columns))

Index(['Age', 'Salary'], dtype='object')
['Age', 'Salary']

In [77]:
df_salary['Distance']=[10,30,2,80,49]
print(df_salary)

   Age  Salary  Distance
0   23   50000        10
1   30   60000        30
2   35   70000         2
3   40   80000        80
4   60   90000        49

In [79]:
df_salary.loc[len(df_salary)] = [39,45000,23] 
print(df_salary)

   Age  Salary  Distance
0   23   50000        10
1   30   60000        30
2   35   70000         2
3   40   80000        80
4   60   90000        49
5   39   45000        23

In [82]:
data = {
    'Age': [23,30,35,40,60],
    'Salary': [50000,60000,70000,80000,90000]
}

df = pd.DataFrame(data)
df

   Age  Salary
0   23   50000
1   30   60000
2   35   70000
3   40   80000
4   60   90000

In [98]:
print(df["Salary"].describe())

count        5.000000
mean     70000.000000
std      15811.388301
min      50000.000000
25%      60000.000000
50%      70000.000000
75%      80000.000000
max      90000.000000
Name: Salary, dtype: float64

In [101]:
print(df.describe())

            Age        Salary
count   5.00000      5.000000
mean   37.60000  70000.000000
std    14.01071  15811.388301
min    23.00000  50000.000000
25%    30.00000  60000.000000
50%    35.00000  70000.000000
75%    40.00000  80000.000000
max    60.00000  90000.000000

In [96]:
print(df['Salary'].sum())
print(df.sum())

350000
Age          188
Salary    350000
dtype: int64

In [95]:
print(df['Salary'].mean())

70000.0

In [103]:
fdata = df[df['Age']>20]
print(fdata)
print(type(fdata))

   Age  Salary
0   23   50000
1   30   60000
2   35   70000
3   40   80000
4   60   90000
<class 'pandas.core.frame.DataFrame'>

In [105]:
df[(df['Age']>28) & (df['Salary']<75000)]

   Age  Salary
1   30   60000
2   35   70000

In [113]:
df = pd.DataFrame({
    "Product": ["Laptop","Mouse","Keyboard","Monitor","HeadtSet"],
    "UnitSold": [12,50,34,20,40],
    "Price": [120000,1300,1500,25000,6000],
    "Discount":[0.10,0.05,0.00,0.12,0.07]
})

In [114]:
df

    Product  UnitSold   Price  Discount
0    Laptop        12  120000      0.10
1     Mouse        50    1300      0.05
2  Keyboard        34    1500      0.00
3   Monitor        20   25000      0.12
4  HeadtSet        40    6000      0.07

In [149]:
df["Final_Price"] = df['Price']  - (df['Price'] * df['Discount'])
print(df)

    Product  UnitSold   Price  Discount  Final_Price  TotalRevenue
0    Laptop        12  120000      0.10     108000.0       1440000
1     Mouse        50    1300      0.05       1235.0         65000
2  Keyboard        34    1500      0.00       1500.0         51000
3   Monitor        20   25000      0.12      22000.0        500000
4  HeadtSet        40    6000      0.07       5580.0        240000

In [ ]:
df["TotalRevenue"] = df["UnitSold"] * df["Final_Price"]
print(df)

    Product  UnitSold   Price  Discount  Final_Price  TotalRevenue
0    Laptop        12  120000      0.10     108000.0     1296000.0
1     Mouse        50    1300      0.05       1235.0       61750.0
2  Keyboard        34    1500      0.00       1500.0       51000.0
3   Monitor        20   25000      0.12      22000.0      440000.0
4  HeadtSet        40    6000      0.07       5580.0      223200.0

In [153]:
df[df["TotalRevenue"] > 500000]

  Product  UnitSold   Price  Discount  Final_Price  TotalRevenue
0  Laptop        12  120000       0.1     108000.0     1296000.0

In [155]:
print(df["TotalRevenue"].sum())

2071950.0